jonathan_odlum/week5/wednesday/planets-moons/app/views/moons/_form.html.erb

    <%= f.label :planet_id, 'Moon' %>
    <%= f.collection_select :planet_id, Planet.all, :id, :name, prompt: 'Please choose the planet' %>
---
SELECT "planets".* FROM "planets"