john_quach/week5/day3/aus-parliament/app/controllers/members_controller.rb

INSERT INTO "members" ("name", "about", "title", "seat", "image", "created_at", "updated_at", "party_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      Member.create member_params  # pass in the strong version of the form params

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def show
      @member = Member.find params[:id]  # ID is in params because of the route "/memebrs/:id"

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def edit
      @member = Member.find params[:id]

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "members" SET "image" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["image", "https://pbs.twimg.com/profile_images/919848581648936960/GDSe6Laq_400x400.jpg"], ["updated_at", "2018-10-10 15:34:31.540332"], ["id", 11]]
---
    def update
      @member = Member.find params[:id]   # route is PATCH "/members/:id", so we have the ID in params
      @member.update member_params

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 7]]
---
    def destroy
      @member = Member.find params[:id]
      @member.destroy