john_quach/week5/day3/aus-parliament/app/controllers/parties_controller.rb

INSERT INTO "parties" ("name", "founded", "abbr", "leader", "position", "ideology", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    Party.create party_params  # pass in the strong version of the form params

SELECT "parties".* FROM "parties"
---
  def index
    @parties = Party.all

SELECT  "parties".* FROM "parties" WHERE "parties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @party = Party.find params[:id]

SELECT  "parties".* FROM "parties" WHERE "parties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @party = Party.find params[:id]

SELECT  "parties".* FROM "parties" WHERE "parties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "parties" SET "name" = ?, "abbr" = ?, "updated_at" = ? WHERE "parties"."id" = ?  [["name", "Free Beer Party"], ["abbr", "FBP"], ["updated_at", "2018-10-10 12:36:42.589579"], ["id", 4]]
---
  def update
    @party = Party.find params[:id]   # route is PATCH "/works/:id", so we have the ID in params
    @party.update party_params

SELECT  "parties".* FROM "parties" WHERE "parties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "parties" WHERE "parties"."id" = ?  [["id", 1]]
---
  def destroy
    @party = Party.find params[:id]
    @party.destroy