brad_dong/week5/Wdi-future-login/app/views/students/_form.html.erb

SELECT "futures".* FROM "futures"
---
    <%= f.label :future_id, 'Class' %>
    <%= f.collection_select :future_id, Future.all, :id, :name, prompt: 'Please choose an class' %>