yianni_moustakas/week5/tuesday/sneaker-list/app/controllers/sneakers_controller.rb

INSERT INTO "sneakers" ("brand", "silhouette", "colorway", "heat_rating", "release_date", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    Sneaker.create(
      brand:          params[:brand],
      silhouette:     params[:silhouette],
      colorway:       params[:colorway],
      heat_rating:    params[:heat_rating],
      release_date:   params[:release_date],
      image_url:      params[:image_url]
    )

SELECT "sneakers".* FROM "sneakers"
---
  def index
  @sneakers = Sneaker.all

SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @sneaker = Sneaker.find params[:id]

SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @sneaker = Sneaker.find params[:id]

SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "sneakers" SET "colorway" = ?, "updated_at" = ? WHERE "sneakers"."id" = ?  [["colorway", "UNDERCOVER Red & Blue"], ["updated_at", "2018-10-09 23:03:37.788060"], ["id", 4]]
---
  def update
    sneaker = Sneaker.find params[:id]
    sneaker.update(
      brand:          params[:brand],
      silhouette:     params[:silhouette],
      colorway:       params[:colorway],
      heat_rating:    params[:heat_rating],
      release_date:   params[:release_date],
      image_url:      params[:image_url]
    )

SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "sneakers" WHERE "sneakers"."id" = ?  [["id", 8]]
---
  def destroy
    sneaker = Sneaker.find params[:id]
    sneaker.destroy