john_quach/week5/day3/aus-parliament/app/views/members/_form.html.erb

    <%= f.label :party_id, 'Party' %>
    <%= f.collection_select :party_id, Party.all, :id, :name, prompt: 'Please choose the Party:' %>
---
SELECT "parties".* FROM "parties"