andy_lau/week5/medicine-db/app/controllers/medicines_controller.rb

INSERT INTO "medicines" ("name", "iupac", "molar_mass", "uses", "image") VALUES (?, ?, ?, ?, ?)  [["name", "helo"], ["iupac", "lo2o2ojfissefjo6"], ["molar_mass", 82.0], ["uses", "everything"], ["image", "http://fillmurray/250/300"]]
---
  def add
    Medicine.create(
      name:       params[:name],
      iupac:      params[:iupac],
      molar_mass: params[:molar_mass],
      uses:       params[:uses],
      image:      params[:image]
    )

SELECT  "medicines".* FROM "medicines" WHERE "medicines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @medicine = Medicine.find(params[:id])

SELECT  "medicines".* FROM "medicines" WHERE "medicines"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "medicines" SET "uses" = ? WHERE "medicines"."id" = ?  [["uses", "Fever, Pain, everything"], ["id", 1]]
---
  def update
    Medicine.find(params[:id]).update(
      name:       params[:name],
      iupac:      params[:iupac],
      molar_mass: params[:molar_mass],
      uses:       params[:uses],
      image:      params[:image]
    )

SELECT "medicines".* FROM "medicines"
---
  def index
    @medicines = Medicine.all

DELETE FROM "medicines" WHERE "medicines"."id" = ?  [["id", 7]]
SELECT  "medicines".* FROM "medicines" WHERE "medicines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    Medicine.find(params[:id]).destroy

SELECT  "medicines".* FROM "medicines" WHERE "medicines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @medicine = Medicine.find params[:id]