yianni_moustakas/week5/wednesday/brands-athletes/app/controllers/brands_controller.rb

  def create
    Brand.create(brand_params) # use string parans to filter the fields from the form (for security reasons)
---
INSERT INTO "brands" ("company_name", "founded", "hq", "ceo", "website", "slogan", "logo_url") VALUES (?, ?, ?, ?, ?, ?, ?)  [["company_name", "poo"], ["founded", 19], ["hq", "poo"], ["ceo", "poo"], ["website", "poo"], ["slogan", "poo"], ["logo_url", "poo"]]

  def show
    @brand = Brand.find params[:id]
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @brand = Brand.find params[:id]
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @brand = Brand.find params[:id]
    @brand.update brand_params
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "brands" SET "slogan" = ? WHERE "brands"."id" = ?  [["slogan", "Just Doo It"], ["id", 1]]

  def destroy
    brand = Brand.find params[:id]
    brand.destroy
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 4]]