andy_lau/week5/authors-db/app/controllers/authors_controller.rb

  def create
    Author.create author_params
---
INSERT INTO "authors" ("name", "country", "dob", "genre", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @author = Author.find params[:id]
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def edit
    @author = Author.find params[:id]
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @author = Author.find params[:id]
    @author.update author_params
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "authors" SET "genre" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["genre", "Dystopia,b"], ["updated_at", "2018-10-10 12:31:41.010955"], ["id", 1]]

  def destroy
    Author.find(params[:id]).delete
---
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 5]]
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]