brad_dong/week5/Wdi-future-login/app/views/futures/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."future_id" = ?  [["future_id", 8]]
---

      <% @future.students.each do|student| %>