brad_dong/week5/Wdi-future-login/app/controllers/application_controller.rb

  def fetch_user
    if session[:user_id].present?
      @current_user = User.find_by :id =>session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]