brad_dong/week5/Wdi-future-login/app/controllers/futures_controller.rb

INSERT INTO "futures" ("name", "year", "location", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    Future.create future_params

SELECT "futures".* FROM "futures"
---
  def index
    @futures = Future.all

SELECT  "futures".* FROM "futures" WHERE "futures"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    @future = Future.find params[:id]

SELECT  "futures".* FROM "futures" WHERE "futures"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @future = Future.find params[:id]

SELECT  "futures".* FROM "futures" WHERE "futures"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "futures" SET "image" = ?, "updated_at" = ? WHERE "futures"."id" = ?  [["image", "https://c1.staticflickr.com/5/4002/4481787462_0e307a7191_b.jpg"], ["updated_at", "2018-10-10 12:07:59.650191"], ["id", 11]]
---
  def update
    @future = Future.find params[:id]
    @future.update future_params

SELECT  "futures".* FROM "futures" WHERE "futures"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "futures" WHERE "futures"."id" = ?  [["id", 4]]
---
  def destroy
    future = Future.find params[:id]
    puts future
    future.destroy