brad_dong/week5/Wdi-future-login/app/controllers/session_controller.rb

  def create
    #see if the email address actually corresponds to a user in the table
    user = User.find_by email: params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "brad@brad"], ["LIMIT", 1]]