brad_dong/week5/Wdi-future-login/app/controllers/students_controller.rb

    def create
      Student.create student_params
---
INSERT INTO "students" ("name", "location", "hobbies", "image", "created_at", "updated_at", "future_id") VALUES (?, ?, ?, ?, ?, ?, ?)

    def show
      @student = Student.find params[:id]
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def edit
      @student = Student.find params[:id]
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
      @student = Student.find params[:id]
      @student.update student_params
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "students" SET "location" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["location", "Sheehind you"], ["updated_at", "2018-10-10 22:07:33.178109"], ["id", 2]]