alex_bryant/week5/wednesday-homework/guitars/app/views/guitars/_form.html.erb

    <%= f.label :manufacturer_id, 'Manufacturer' %>
    <%= f.collection_select :manufacturer_id, Manufacturer.all, :id, :name, prompt: "Please Choose a manufacturer" %>
---
SELECT "manufacturers".* FROM "manufacturers"