alex_bryant/week5/wednesday-homework/guitars/app/views/manufacturers/show.html.erb

<ul>
<% @manufacturer.guitars.each do |guitar| %>
---
SELECT "guitars".* FROM "guitars" WHERE "guitars"."manufacturer_id" = ?  [["manufacturer_id", 1]]