jonathan_odlum/week5/wednesday/planets-moons/app/controllers/moons_controller.rb

INSERT INTO "moons" ("name", "discovery", "discoverer", "image", "period", "planet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    Moon.create moon_params

SELECT "moons".* FROM "moons"
---
  def index
    @moons = Moon.all

SELECT  "moons".* FROM "moons" WHERE "moons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @moon = Moon.find(params[:id])

SELECT  "moons".* FROM "moons" WHERE "moons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @moon = Moon.find(params[:id])

SELECT  "moons".* FROM "moons" WHERE "moons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "moons" SET "image" = ?, "updated_at" = ? WHERE "moons"."id" = ?
---
  def update
    @moon = Moon.find(params[:id])
    @moon.update moon_params

SELECT  "moons".* FROM "moons" WHERE "moons"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "moons" WHERE "moons"."id" = ?  [["id", 5]]
---
  def destroy
    @moon = Moon.find(params[:id])
    @moon.destroy