jonathan_odlum/week5/wednesday/planets-moons/app/controllers/planets_controller.rb

INSERT INTO "planets" ("name", "orbit", "temperature", "year", "day", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    Planet.create (planet_params)

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    @planet = Planet.find(params[:id])

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def edit
    @planet = Planet.find(params[:id])

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "planets" SET "image" = ?, "updated_at" = ? WHERE "planets"."id" = ?
---
  def update
    @planet = Planet.find(params[:id])
    @planet.update planet_params

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 4]]
---
  def destroy
    @planet = Planet.find(params[:id])
    @planet.destroy