mika_mccarron/week5/books.db/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def fetch_user
    if session[:user_id].present?
      @current_user = User.find_by id: session[:user_id]