mika_mccarron/week5/books.db/app/controllers/authors_controller.rb

  def index
    @authors = Author.all # returns an array of Artist objects
---
SELECT "authors".* FROM "authors"

  def show
    @author = Author.find params[:id] # returns one Artist object
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]