mika_mccarron/week5/books.db/app/controllers/books_controller.rb

  def create
  Book.create(
    title:params[:title],
    author:params[:author],
    published_year:params[:published_year],
    image:params[:image],
  )
---
INSERT INTO "books" ("title", "author", "published_year", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def index
    @books = Book.all #Get all rows in the plannets table
---
SELECT "books".* FROM "books"

  def show
    #gets us one row, and returns it as an object
    @book = Book.find params[:id]
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def edit
    @book = Book.find params[:id]
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def update
    book = Book.find params[:id]
    book.update(
      title:params[:title],
      author:params[:author],
      published_year:params[:published_year],
      image:params[:image]
    )
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "author" = ?, "published_year" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Yogini"], ["author", "Vicky "], ["published_year", 2000], ["updated_at", "2018-10-09 08:11:19.031092"], ["id", 6]]

  def destroy
    book = Book.find params[:id]
    book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 6]]