jonathan_odlum/week5/wednesday/planets-moons/app/views/planets/show.html.erb

<br>
<% @planet.moons.each do |moon| %>
---
SELECT "moons".* FROM "moons" WHERE "moons"."planet_id" = ?  [["planet_id", 5]]