john_quach/week5/day3/aus-parliament/app/views/parties/show.html.erb

SELECT "members".* FROM "members" WHERE "members"."party_id" = ?  [["party_id", 13]]
---
  <ul>
  <% @party.members.each do |member| %>