alex_bryant/week5/wednesday-homework/guitars/app/controllers/guitars_controller.rb

  def destroy
    guitar = Guitar.find params[:id]
    guitar.destroy
---
SELECT  "guitars".* FROM "guitars" WHERE "guitars"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "guitars" WHERE "guitars"."id" = ?  [["id", 4]]

  def update
    @guitar = Guitar.find params[:id]
    @guitar.update(guitar_params)
---
SELECT  "guitars".* FROM "guitars" WHERE "guitars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "guitars" SET "price" = ?, "updated_at" = ? WHERE "guitars"."id" = ?  [["price", 3200], ["updated_at", "2018-10-10 11:32:40.837846"], ["id", 1]]

  def edit
    @guitar = Guitar.find params[:id]
---
SELECT  "guitars".* FROM "guitars" WHERE "guitars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @guitars = Guitar.all
---
SELECT "guitars".* FROM "guitars"

  def show
    @guitar = Guitar.find params[:id]
---
SELECT  "guitars".* FROM "guitars" WHERE "guitars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]