alex_bryant/week5/wednesday-homework/guitars/app/controllers/manufacturers_controller.rb

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "manufacturers" WHERE "manufacturers"."id" = ?  [["id", 4]]
---
  def destroy
    manufacturer = Manufacturer.find params[:id]
    manufacturer.destroy

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "manufacturers" SET "name" = ?, "country" = ?, "updated_at" = ? WHERE "manufacturers"."id" = ?  [["name", "Gibsone"], ["country", "UK"], ["updated_at", "2018-10-10 11:55:31.882814"], ["id", 12]]
---
  def update
    @manufacturer = Manufacturer.find params[:id]
    puts "=" * 50
    puts @manufacturer.founded
    puts params[:founded]
    params[:founded] = params[:founded].to_i
    @manufacturer.update(manufacturer_params)

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def edit
    @manufacturer = Manufacturer.find params[:id]

INSERT INTO "manufacturers" ("name", "country", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Gibson"], ["country", "UK"], ["image", "http://placekitten.com/300/300"], ["created_at", "2018-10-10 11:55:52.840507"], ["updated_at", "2018-10-10 11:55:52.840507"]]
---
  def create

    Manufacturer.create(manufacturer_params)

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def show
    @manufacturer = Manufacturer.find params[:id]