brad_dong/week5/chairs-db/app/controllers/chairs_controller.rb

INSERT INTO "chairs" ("name", "image", "legs", "material", "recliner", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Brad"], ["image", ""], ["legs", 2], ["material", "metal"], ["recliner", 1], ["created_at", "2018-10-09 07:38:57.261119"], ["updated_at", "2018-10-09 07:38:57.261119"]]
---
  def create  #create submission
    Chair.create(
      name: params[:name],
      image: params[:image],
      legs: params[:legs],
      material: params[:material],
      recliner: params[:recliner]
    )

SELECT "chairs".* FROM "chairs"
---
  def index #show all chairs
    @chairs = Chair.all

SELECT  "chairs".* FROM "chairs" WHERE "chairs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show #show individual chair
    @chair = Chair.find params[:id]

SELECT  "chairs".* FROM "chairs" WHERE "chairs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def edit
    @chair = Chair.find params[:id]

SELECT  "chairs".* FROM "chairs" WHERE "chairs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "chairs" SET "name" = ?, "updated_at" = ? WHERE "chairs"."id" = ?  [["name", "Rockyadasdfs"], ["updated_at", "2018-10-09 09:19:37.951036"], ["id", 20]]
---
  def update
    chair = Chair.find params[:id]
    puts "+++++++++++++++++++++++++++++++++++++++++++"
    puts chair
    puts "+++++++++++++++++++++++++++++++++++++++++++"
    chair.update(
      name: params[:name],
      image: params[:image],
      legs: params[:legs],
      material: params[:material],
      recliner: params[:recliner]
    )

SELECT  "chairs".* FROM "chairs" WHERE "chairs"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "chairs" WHERE "chairs"."id" = ?  [["id", 16]]
---
  def destroy
      chair = Chair.find params[:id]
      chair.destroy