alex_scriven/week5/mountains-mvc/app/controllers/mountains_controller.rb

INSERT INTO "mountains" ("name", "country", "elevation", "image", "pointyness", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  Mountain.create(
   name: params[:name],
   country: params[:country],
   elevation: params[:elevation],
   pointyness: params[:pointyness],
   image: params[:image]
  )

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @mountain = Mountain.find(params[:id])

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @mountain = Mountain.find(params[:id])

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mountains" SET "name" = ?, "updated_at" = ? WHERE "mountains"."id" = ?  [["name", "Mt Fujii"], ["updated_at", "2018-10-09 23:05:27.097386"], ["id", 1]]
---
  def update
    mountain = Mountain.find(params[:id])
    mountain.update(
     name: params[:name],
     country: params[:country],
     elevation: params[:elevation],
     pointyness: params[:pointyness],
     image: params[:image]
    )

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 7]]
---
  def destroy
    mountain = Mountain.find(params[:id])
    mountain.destroy