hannah_greenwell/week5/world-leaders-db/app/controllers/world_leaders_controller.rb

  def index
    @world_leaders = WorldLeader.all
---
SELECT "world_leaders".* FROM "world_leaders"

  def show
    @world_leader = WorldLeader.find params[:id]
---
SELECT  "world_leaders".* FROM "world_leaders" WHERE "world_leaders"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    WorldLeader.create(
      name: params[:name],
      country: params[:country],
      years_in_office: params[:years_in_office],
      alive: params[:alive],
      image: params[:image],
      quote: params[:quote]
    )
---
INSERT INTO "world_leaders" ("name", "country", "years_in_office", "alive", "image", "quote", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @world_leader = WorldLeader.find params[:id]
---
SELECT  "world_leaders".* FROM "world_leaders" WHERE "world_leaders"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
    world_leader = WorldLeader.find params[:id]

    world_leader.update(
      name: params[:name],
      country: params[:country],
      years_in_office: params[:years_in_office],
      alive: params[:alive],
      image: params[:image],
      quote: params[:quote]
    )
---
SELECT  "world_leaders".* FROM "world_leaders" WHERE "world_leaders"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "world_leaders" SET "country" = ?, "updated_at" = ? WHERE "world_leaders"."id" = ?  [["country", "France"], ["updated_at", "2018-10-09 08:58:50.827733"], ["id", 4]]

  def destroy
    world_leader = WorldLeader.find params[:id]
    world_leader.destroy
---
SELECT  "world_leaders".* FROM "world_leaders" WHERE "world_leaders"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "world_leaders" WHERE "world_leaders"."id" = ?  [["id", 5]]