john_quach/week5/day2/camping-sites/app/controllers/campsites_controller.rb

  def create

    Campsite.create(
      name: params[:name],
      location: params[:location],
      campsite_type: params[:campsite_type],
      max_people: params[:max_people],
      per_night: params[:per_night]
    )
---
INSERT INTO "campsites" ("name", "location", "campsite_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["location", ""], ["campsite_type", ""], ["created_at", "2018-10-09 11:41:02.945481"], ["updated_at", "2018-10-09 11:41:02.945481"]]

  def index
    # Get all rows in the campsites table
    # (as an array of Campsite objects)
    @campsites = Campsite.all
---
SELECT "campsites".* FROM "campsites"

  def show
    # Gets us one row, and returns it as an object
    # (an instance of the Campsite model class)
    @campsite = Campsite.find params[:id]
---
SELECT  "campsites".* FROM "campsites" WHERE "campsites"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def edit
    @campsite = Campsite.find params[:id]
---
SELECT  "campsites".* FROM "campsites" WHERE "campsites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    campsite = Campsite.find params[:id]
    campsite.update(
      name: params[:name],
      location: params[:location],
      campsite_type: params[:campsite_type],
      max_people: params[:max_people],
      per_night: params[:per_night]

    )
---
SELECT  "campsites".* FROM "campsites" WHERE "campsites"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "campsites" SET "name" = ?, "location" = ?, "max_people" = ?, "updated_at" = ? WHERE "campsites"."id" = ?  [["name", "Barrington Tops"], ["location", "Barringtop Tops"], ["max_people", nil], ["updated_at", "2018-10-09 12:28:50.591665"], ["id", 3]]

  def destroy
    campsite = Campsite.find params[:id]
    campsite.destroy
---
SELECT  "campsites".* FROM "campsites" WHERE "campsites"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "campsites" WHERE "campsites"."id" = ?  [["id", 7]]