alex_bryant/week5/tuesday-homework/programming-languages/app/controllers/languages_controller.rb

SELECT  "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
DELETE FROM "languages" WHERE "languages"."id" = ?  [["id", 30]]
---
  def delete
    language = Language.find params[:id]
    language.destroy

SELECT  "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
UPDATE "languages" SET "name" = ?, "sample_hello_world" = ?, "updated_at" = ? WHERE "languages"."id" = ?  [["name", "Ruby2"], ["sample_hello_world", "# My first Ruby program\r\n# On my way to Ruby fame & fortune!\r\n\r\nputs 'Hello, world!'"], ["updated_at", "2018-10-09 12:30:06.954332"], ["id", 34]]
---
  def update
    language = Language.find params[:id]
    language.update(
      name: params[:name],
      description: params[:description],
      sample_hello_world: params[:sample_hello_world],
      imperative: trueOrFalse(params[:imperative]),
      object_oriented: trueOrFalse(params[:object_oriented]),
      functional: trueOrFalse(params[:functional]),
      procedural: trueOrFalse(params[:procedural]),
      generic: trueOrFalse(params[:generic]),
      reflective: trueOrFalse(params[:reflective]),
      event_driven: trueOrFalse(params[:event_driven]),
      other_paradigms: params[:other_paradigms],
      standardized: params[:standardized],
    )

SELECT  "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]
---
  def edit
    @language = Language.find params[:id]

INSERT INTO "languages" ("name", "description", "sample_hello_world", "imperative", "object_oriented", "functional", "procedural", "generic", "reflective", "event_driven", "other_paradigms", "standardized", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    Language.create(
      name: params[:name],
      description: params[:description],
      sample_hello_world: params[:sample_hello_world],
      imperative: trueOrFalse(params[:imperative]),
      object_oriented: trueOrFalse(params[:object_oriented]),
      functional: trueOrFalse(params[:functional]),
      procedural: trueOrFalse(params[:procedural]),
      generic: trueOrFalse(params[:generic]),
      reflective: trueOrFalse(params[:reflective]),
      event_driven: trueOrFalse(params[:event_driven]),
      other_paradigms: params[:other_paradigms],
      standardized: params[:standardized],
    )

SELECT "languages".* FROM "languages"
---
  def index
    @languages = Language.all

SELECT  "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]
---
  def show
    @language = Language.find params[:id]